<%--<!DOCTYPE html>--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<% String path = request.getContextPath(); %>
<%@ taglib  prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<html>

<head>

    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">


    <title> - 数据表格</title>
    <meta name="keywords" content="">
    <meta name="description" content="">

    <link rel="shortcut icon" href="favicon.ico"> <link href="<%=path%>/css/bootstrap.min.css?v=3.3.6" rel="stylesheet">
    <link href="<%=path%>/css/font-awesome.css?v=4.4.0" rel="stylesheet">

    <!-- Data Tables -->
    <link href="<%=path%>/css/plugins/dataTables/dataTables.bootstrap.css" rel="stylesheet">

    <link href="<%=path%>/css/animate.css" rel="stylesheet">
    <link href="<%=path%>/css/style.css?v=4.1.0" rel="stylesheet">

</head>

<body class="gray-bg">
<div class="wrapper wrapper-content animated fadeInRight">
    <div class="row">
        <div class="col-sm-12">
            <div class="ibox float-e-margins">
                <div class="ibox-title">
                    <h5>基本 <small>分类，查找</small></h5>
                    <div class="ibox-tools">
                        <a class="collapse-link">
                            <i class="fa fa-chevron-up"></i>
                        </a>
                        <a class="dropdown-toggle" data-toggle="dropdown" href="<%=path%>/binglishujuku.jsp#">
                            <i class="fa fa-wrench"></i>
                        </a>
                        <ul class="dropdown-menu dropdown-user">
                            <li><a href="<%=path%>/binglishujuku.jsp#">选项1</a>
                            </li>
                            <li><a href="<%=path%>/binglishujuku.jsp#">选项2</a>
                            </li>
                        </ul>
                        <a class="close-link">
                            <i class="fa fa-times"></i>
                        </a>
                    </div>
                </div>
                <div class="ibox-content">

                    <table class="table table-striped table-bordered table-hover dataTables-example">
                        <thead>
                        <tr>
                            <th>性别</th>
                            <th>年龄</th>
                            <th>病史摘要</th>
                            <th>临床诊断</th>
                            <th>大体所见</th>
                        </tr>
                        </thead>
                        <tbody>
                        <tr><td> "男"</td><td> "61岁"</td><td> "距门齿18cm，20cm各见一处不规则隆起，表面不平，覆秽苔。",</td><td> "食管癌？", </td><td> "灰白、灰红组织3粒，直径均约0.1厘米。"</td></tr>
                        <tr><td> "男"</td><td> "65岁"</td><td> "左眼上睑缘肿物",</td><td> "左眼上睑缘肿物", </td><td> "灰褐色肿物，直径0.6厘米，切面实性，灰褐色，质中。"</td></tr>
                        <tr><td> "女"</td><td> "34岁"</td><td> "孕41＋1周行剖宫产术，见子宫后壁一浆膜下肌瘤约0.8*0.8厘米大小",</td><td> "子宫肌瘤", </td><td> "灰白结节一枚，大小1.4*1.2*1.0厘米，切面灰白，质中。"</td></tr>
                        <tr><td> "女"</td><td> "42岁"</td><td> "发现右乳肿块1月余入院",</td><td> "右乳肿块", </td><td> "灰红结节状标本一件，大小4.0×4.0×3.0cm，包膜完整，切面灰白灰红"</td></tr>
                        <tr><td> "男"</td><td> "68岁"</td><td> "患者系咽痛不适3月余入院，术中见：咽喉部及咽侧壁溃疡侧面各取一块，摘除送病理",</td><td> "咽部溃疡", </td><td> "灰白小组织两件，大小共0.4cm"</td></tr>
                        <tr><td> "女"</td><td> "60岁"</td><td> "左大腿外侧皮肤肿块10余年，发现肿块渐增大，近期肿块表面破溃伴皮肤瘙痒；左侧大腿外侧见一长径2.0cm圆形肿块，突出于皮肤表面",</td><td> "左侧大腿外侧皮肤肿块", </td><td> "皮肤组织一块，长径1.5cm，表面见一约1.4cm的隆起型肿物"</td></tr>
                        <tr><td> "女"</td><td> "79岁"</td><td> "突发肉眼血尿4天，B超</td><td>膀胱三角区左外侧15.0*11.0mm占位",</td><td> "膀胱占位", </td></tr>
                        <tr><td> "女"</td><td> "41岁"</td><td> "术中见左下胸部包块，3×2cm，内见粉刺样分泌物",</td><td> "左胸壁包块？", </td><td> "皮肤组织一件，大小3.1×2.1×2.0cm，皮肤中央见1.5×1.3的灰红隆起，皮下见1.3×1.1的灰白结节"</td></tr>
                        <tr><td> "女"</td><td> "56岁"</td><td> "体检发现左乳肿物2月余。术中见左乳2点NT1.0cm处可见19x12mm低回声像，边界清。",</td><td> "左乳肿物", </td><td> "1、（冰冻）灰白淡黄色左侧乳腺12点条索状组织2条，长0.5cm-1.5cm，直径0.4cm。2、另送灰白淡黄色左侧乳腺12点条索状组织一堆，大小3.0x2.5x1.0cm。"</td></tr>
                        <tr><td> "女"</td><td> "35岁"</td><td> "发现左乳包块渐增大一年",</td><td> "左乳包块", </td><td> "灰白间灰红色不规则组织一件，大小1.7厘米*1.0厘米*0.6厘米。"</td></tr>
                        <tr><td> "女"</td><td> "45岁"</td><td> "CT提示左前上纵膈占位性病变",</td><td> "左前上纵膈占位", </td><td> "灰红结节状标本一件，部分附有包膜，8×6.5×4.5cm，切面灰白色，多结节状"</td></tr>
                        <tr><td> "女"</td><td> "65岁"</td><td> "左上唇见长径2.0cm的皮肤肿物",</td><td> "左上唇肿物", </td><td> "皮肤组织一件，大小1.5×1.1×0.7cm，表面见一长径1.0cm的黑色隆起性肿物"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "胆囊增大，完整切除胆囊，术中见脾下极一大小约8.0cm的肿块，将脾及肿块一起切除。",</td><td> "1.胆囊结石伴慢性慢性胆囊炎 2.脾囊肿", </td><td> "脾脏切除标本一件，大小为16.0cm*7.5cm*5.0cm，脾脏一极可见多囊性肿物，大小约为8.5cm*7.0cm*4.5cm，囊内见暗红色浆液，囊壁厚0.1cm。,已打开胆囊标本一件，大小为6.5cm*3.0cm*1.0cm,壁厚0.3cm，粘膜粗糙，袋内胆固醇性结石数枚。"</td></tr>
                        <tr><td> "女"</td><td> "29岁"</td><td> "发现右乳肿物10天余。术中见右乳肿物大小15cmx10cm，腋窝下淋巴结送检约15个，其中一个大小为2cmx2cm肿大。",</td><td> "右乳浸润性癌", </td><td> "1、（右乳）改良根治乳腺标本一个，大小15.0cmx14.0cmx5.0cm，相连腋窝脂肪组织大小9.0cmx5.0cm，表面上附梭形皮肤大小13.0cmx8.0cm，乳头直径1.0cm，无凹陷，经乳头最长径每隔0.5cm不间断切开标本，切面距乳头1.5cm处可见一大小为6.0cmx5.0cmx2.0cm灰白灰黄色肿物，质中，界不清，伴大量粉刺样坏死。,2、另送右侧腋窝淋巴结：脂肪样组织一堆，大小5.0cmx3.0cmx2.0cm，触及十多个淋巴结，质韧。"</td></tr>
                        <tr><td> "女"</td><td> "47岁"</td><td> "右乳腺结节性质待查",</td><td> "右乳腺结节性质待查", </td><td> "灰白灰黄破碎软一堆，大小2.5*2*0.6cm"</td></tr>
                        <tr><td> "男"</td><td> "19岁"</td><td> "右髋疼痛、活动受限2月入院，X示右股骨大转子处低密度影，术中见肉芽样组织，骨皮质尚完整",</td><td> "右股骨大转子肿瘤病变", </td><td> "灰红碎组织两件，大小共2.5×1.2×0.6cm"</td></tr>
                        <tr><td> "男"</td><td> "63岁"</td><td> "体检发现乙状结肠息肉1周。",</td><td> "结肠息肉", </td><td> "（乙状结肠息肉）灰褐间灰白小组织一枚，大小为1.8cm*1.6cm*1.2cm。"</td></tr>
                        <tr><td> "女"</td><td> "67岁"</td><td> "反复头痛2年，加重2月入院",</td><td> "右颞部占位", </td><td> "灰红结节状标本，长径4cm×3cm×2.5cm，切面灰红，局部出血、质软，外附脑膜组织一块，大小2.5cm×1.5cm"</td></tr>
                        <tr><td> "男"</td><td> "47岁"</td><td> "因右输尿管结石、肾绞痛行右侧输尿管镜检查，术中见膀胱颈内侧7点处新生物，呈菜花状，长径约0.3cm，予以活检",</td><td> "膀胱新生物待查，右侧输尿管结石", </td><td> "灰白小组织2粒，长径0.1-0.2cm"</td></tr>
                        <tr><td> "女"</td><td> "60岁"</td><td> "宫颈硬，考虑宫颈癌",</td><td> "宫颈硬，考虑宫颈癌", </td><td> "未知"</td></tr>
                        <tr><td> "男"</td><td> "41岁"</td><td> "发现HBSAg（+）半年，反复乏力2月余入院",</td><td> "乙肝后肝硬化", </td><td> "穿刺条2条，长径1.0-1.2cm，直径0.2cm"</td></tr>
                        <tr><td> "女"</td><td> "60岁"</td><td> "绝经10年，阴道流血2天。宫颈质硬，阴道穹隆见异常赘生物。宫颈6、12、11、3取少许组织送病检。",</td><td> "宫颈癌", </td><td> "灰白色宫颈组织4块，直径0.2cm-1.0cm。,灰红色颈管组织一堆，大小2.5cm×2.0cm×0.4cm。"</td></tr>
                        <tr><td> "女"</td><td> "41岁"</td><td> "无",</td><td> "卵巢囊肿", </td><td> "灰红已破囊壁样组织一堆，大小7*4*3.5cm，囊壁厚0.2-0.5cm，局部附少许乳头状突起。"</td></tr>
                        <tr><td> "女"</td><td> "36岁"</td><td> "发现左乳肿块渐增大半年。",</td><td> "左乳肿块", </td><td> "（左乳）灰白色结节一枚，大小为2.3cm*1.5cm*1.5cm，包膜完整，切面灰白，质中。"</td></tr>
                        <tr><td> "男"</td><td> "54岁"</td><td> "胃窦后壁见一直径约3cm的溃疡增殖性病变",</td><td> "胃窦溃疡增殖性病变，ca?", </td><td> "灰白小组织6粒，长径0.1-0.2cm"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "术中见子宫前壁一肌瘤约5.0cm*4.0cm大小。",</td><td> "子宫肌瘤", </td><td> "（子宫）灰白结节一枚，大小为4.5cm*4.5cm*3.0cm，切面灰白色，编织状，质韧。"</td></tr>
                        <tr><td> "女"</td><td> "69岁"</td><td> "术中见胆囊肿大，期内见胆汁及胆石",</td><td> "胆囊炎，胆总管扩张伴结石", </td><td> "胆囊一件，12×4×4cm，囊壁充血、水肿，内含浓缩胆汁，内见大量混合性结石，近胆囊管处见一2×0.5cm的菜花状息肉，无蒂，胆囊黏膜粗糙，近底部部分区域囊壁黏膜欠光滑"</td></tr>
                        <tr><td> "女"</td><td> "43岁"</td><td> "右乳肿块1年，右乳9点乳头旁见约8×7cm肿块，质较硬，界欠清，欠规则，活动差，似与皮肤粘连。",</td><td> "右乳癌", </td><td> "带梭形皮肤右侧乳腺根治标本一个，大小27.0cm×16.0cm×5.0cm，乳头直径1.5cm，皮肤大小14.0cm×6.0cm，距乳头下1.0cm处见灰白色肿物一个，直径4.5cm，切面灰白色，伴坏死，边界不清，肿瘤中央见空洞，最大径2.5cm，乳腺基底面相连肌肉组织一块，大小7.0×3.0cm×2.0cm。,送检右乳淋巴结16枚，直径0.3-1.5cm"</td></tr>
                        <tr><td> "男"</td><td> "44岁"</td><td> "肛内肿物脱出伴出血间作7年",</td><td> "混合痔，肛乳头肥大", </td><td> "（肛门）灰白间灰褐色黏膜样组织一堆，大小共4.0厘米*3.5厘米*1.5厘米，黏膜下淤血，切面灰白间灰褐色，质地中等。"</td></tr>
                        <tr><td> "男"</td><td> "61岁"</td><td> "右侧颧面部结节性肿块2月余，进行性增大一月余，无疼痛，边界尚 清晰，大小约1.0×0.8cm",</td><td> "右侧面部肿块", </td><td> "皮肤组织一件，大小1.8×1.2×0.8cm，皮肤中央见一1×0.7cm的灰白区域"</td></tr>
                        <tr><td> "女"</td><td> "21岁"</td><td> "发现肝硬化2月余，查体肝病面容，心肺（-）",</td><td> "慢性乙型肝炎", </td><td> "穿刺条2条，长径1.6-2.5cm"</td></tr>
                        <tr><td> "女"</td><td> "53岁"</td><td> "术中见肿物位于腮腺内，与周围组织粘连，质中",</td><td> "左腮腺肿物", </td><td> "（左腮腺肿物）灰红组织一块，2.5×2.0×1.1cm，似有部分包膜，切面灰红，多结节状，质中"</td></tr>
                        <tr><td> "女"</td><td> "40岁"</td><td> "发现左甲状腺占位4个月入院，B超显示双侧甲状腺多发结节",</td><td> "左甲状腺占位", </td><td> "（左侧）灰红甲状腺组织一件，大小5.0cm×3.0cm×2.0cm，切面呈多结节状，径0.2-2.0cm（右侧）甲状腺组织一件，大小2.5cm×1.5cm×1.0cm，切面见2枚结节，长径分别为0.8cm-1.0cm"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "患者以子宫腺肌病收入院，肝功能检查异常，完善相关检查，抗核抗体>1</td><td>100；IgG >1.1ULN；住院期间查肝功能异常（见附件检验单信息）。",</td><td> "自身免疫性肝炎", </td></tr>
                        <tr><td> "女"</td><td> "47岁"</td><td> "移动性浊音（+）。妇科检查</td><td>宫颈肥大内口糜烂；宫体扪及不清，附件区扪及不清。三合诊：直肠粘膜光滑无血染，右侧宫旁质硬包块无压痛扪及不清。AFP、CEA正常，CA125 956.2KU/l。腹部彩超：诊断所见</td><td>子宫大小约4.9×3.9×4.1cm，形态正常，轮廓线清晰光滑，宫内肌层回声均匀，内膜厚0.4cm，居中，宫内未见明显异常团块回声。宫颈前后径约3.1cm。 左侧卵巢大小约4.6×3.9cm，右侧附件区未见明显异常。腹膜后见多个低回声，边界清，轮廓规则，其中一大小约4.7×3.0cm。双肾形态大小正常，包膜光整，结构清晰，实质回声均匀，集合系统回声不分离。左肾见一直径约0.3cm强回声光点，后方伴彗尾。肿瘤标志物三项：甲胎蛋白 2.35 ng/ml、糖链抗原19-9 4.90 U/ml、癌胚抗原 0.56 ng/ml，生殖激素：卵泡刺激素 5.59 mIU/ml、促黄体生成素 40.36 mIU/ml、雌二醇 62.00 pg/mL，妇科肿瘤三项：糖链抗原15-3 23.74 U/ml、糖链抗原125 1229.34 U/ml、β人绒毛膜促性腺激素 4.55 mIU/ml术中探查见：盆腔内腹水色淡黄，腹膜肠管、大网膜、子宫输卵管卵巢表面、膀胱浆膜表面见散在粟粒状包块结节，最小针尖大小，最大米粒大小，子宫约5*4*4cm，左侧卵巢增大漂浮腹水中，质硬，卵巢输卵管表面见赘生物附着，右侧卵巢大小正常输卵管形态正常。肝脏表面未见明显异常，升结肠内侧平脐腹膜后扪及质硬包块约4*3*3cm及1cm大小不等质硬包块数个。",</td></tr>
                        <tr><td> "女"</td><td> "42岁"</td><td> "发现肛门皮下肿块1年余",</td><td> "肛门皮肤肿块", </td><td> "灰白结节样组织一件，大小0.6×0.6×0.5cm"</td></tr>
                        <tr><td> "男"</td><td> "63岁"</td><td> "反复右上腹疼痛6月余",</td><td> "胆囊息肉", </td><td> "胆囊一件，大小8×3×1cm，内含少量色素性结石，囊壁粗糙，囊壁厚0.4cm"</td></tr>
                        <tr><td> "女"</td><td> "28岁"</td><td> "左侧乳房肿物四月余，左侧乳房外上象限肿物约1.2cm*2.0cm。",</td><td> "左侧乳房肿物", </td><td> "（左侧乳房）灰白间灰黄色不规则组织一枚，大小为2.5cm*1.8cm*1.2cm，切面灰白间灰黄色，质地中等。"</td></tr>
                        <tr><td> "男"</td><td> "80岁"</td><td> "发现右小腿肿块一月余，近期渐增大",</td><td> "右小腿肿块", </td><td> "皮肤组织一块，大小4.5×2.5×1.0cm，表面见一灰白隆起病灶，长径1.5cm，切面灰白色"</td></tr>
                        <tr><td> "女"</td><td> "48岁"</td><td> "发现右乳肿块半年余，局麻下行右乳肿块微创手术",</td><td> "右乳肿块", </td><td> "灰白碎组织一堆，大小3.0×3.0×1.0cm"</td></tr>
                        <tr><td> "女"</td><td> "51岁"</td><td> "左乳溢血3月余入院",</td><td> "左乳溢血待查", </td><td> "灰白灰黄组织一件，大小5.0×4.5×3cm，内含导丝一枚，切面见一扩张导管，内含乳头状新生物，长径约0.5cm，余切面灰白色，无明显肿物"</td></tr>
                        <tr><td> "女"</td><td> "46岁"</td><td> "阴道出血较多，行诊刮术",</td><td> "子宫内膜ca？", </td><td> "灰红碎组织一堆，长径5cm"</td></tr>
                        <tr><td> "女"</td><td> "70岁"</td><td> "右眼下睑黑色肿块，可见溃疡灶，大小约1×1cm，",</td><td> "右眼下睑包块（基底细胞癌？）", </td><td> "灰白灰红结节一枚，大小1.5×1.0×0.6cm，全取"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "右眼上睑内黄色隆起一年余",</td><td> "右眼上睑肿物", </td><td> "（右眼上睑）灰白色组织一枚，大小为 0.5×0.5×0.1cm，切面灰白间灰黄色，质地中等。对剖。"</td></tr>
                        <tr><td> "男"</td><td> "9岁"</td><td> "发现右中指包块2月余，术中发现右中指关节指骨腹侧见一大小约1×1cm包块，位于指骨表面，无明确包膜，侵蚀骨质达髓腔",</td><td> "右中指关节包块", </td><td> "灰白碎组织一堆，1.5×1×0.5cm"</td></tr>
                        <tr><td> "男"</td><td> "53岁"</td><td> "下唇部肿块性质待查",</td><td> "下唇部肿块", </td><td> "灰白组织一件，大小0.8×0.8×0.4cm，切面见一结节，长径约0.4cm"</td></tr>
                        <tr><td> "女"</td><td> "49岁"</td><td> "双乳肿块微创旋切术",</td><td> "双乳肿块", </td><td> "（左侧）灰红灰黄碎组织，大小2.0cm*1.0cm*0.5cm（右侧）灰红碎组织，大小0.5cm*0.5cm*0.3cm"</td></tr>
                        <tr><td> "男"</td><td> "51岁"</td><td> "患者有多年痛风病史，术中见多个白色肿物",</td><td> "左手腕肿块", </td><td> "灰白碎组织一堆，5×4×1cm，切面灰白灰黄色，灰白色区域似石灰样"</td></tr>
                        <tr><td> "女"</td><td> "75岁"</td><td> "左上唇肿物7年余，伴破溃半年，上唇左侧可见一1×1cm大小肿块，突出于皮肤表面，伴溃烂",</td><td> "左上唇溃疡", </td><td> "皮肤组织一件，大小1.5×1×0.3cm，表面见一长径0.8cm的溃疡"</td></tr>
                        <tr><td> "男"</td><td> "65岁"</td><td> "左腘窝外侧一大小约3.0cm*1.0cm包块。",</td><td> "左腘窝包块", </td><td> "（左侧腘窝）灰黄色结节一枚，大小约2.5cm*2.0cm*1.3cm，切面灰黄间灰白色，质地中等。"</td></tr>
                        <tr><td> "男"</td><td> "63岁"</td><td> "乙肝病史数年，小三阳，白细胞血小板偏低，胆囊结石",</td><td> "慢性乙型肝炎", </td><td> "（肝脏）灰黄色小组织一枚，大小为0.5*0.4*0.2cm，切面灰黄色，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "43岁"</td><td> "双眼上睑内眦黄色隆起半年余。",</td><td> "双眼上睑黄色瘤", </td><td> "（双眼上睑）皮肤样小组织两枚，大小分别为0.7cm*0.4cm*0.3cm及0.5cm*0.2cm*0.2cm。"</td></tr>
                        <tr><td> "男"</td><td> "79岁"</td><td> "主诉</td><td>发现右耳前无痛性包块3月余现病史</td><td>患者自诉约于3月余前无意中发现右耳前有一\"黄豆\"大小包块，无疼痛、麻木等不适，未加以重视，未行任何诊治。近期感包块逐渐增大，且局部稍有疼痛，无发热、寒战等全身不适症状，来我院行穿刺细胞学检查示：右耳前考虑乳头状囊腺瘤。今来我院要求住院治疗，门诊以\"右腮腺包块待查\"收治入院。既往史</td></tr>
                        <tr><td> "女"</td><td> "32岁"</td><td> "...........",</td><td> "CIN 3", </td><td> "灰白扁平样组织一块，大小2.0cm*1.0cm*0.5cm"</td></tr>
                        <tr><td> "男"</td><td> "42岁"</td><td> "发现头部皮下肿物一月余，质软，无压痛。",</td><td> "头部皮下肿物", </td><td> "（头部）灰白间灰黄结节一枚，大小为1.0厘米*0.5厘米*0.5厘米，切面灰黄色，质地软。"</td></tr>
                        <tr><td> "女"</td><td> "79岁"</td><td> "发现右乳包块1年余。",</td><td> "右侧乳房肿块性质待查：纤维腺瘤？", </td><td> "送检结节状组织2枚，小者2*1.8*1.5cm，大者3*2*1.8cm，均已切开，切面灰白，质中。"</td></tr>
                        <tr><td> "女"</td><td> "83岁"</td><td> "发现左眼睑外侧肿块1年余",</td><td> "左眼睑外侧肿块", </td><td> "皮肤组织一件，大小3.0×1.5×0.3cm，表面中央见一2.5×2cm灰白肿块，切面灰白色，表面糜烂，另送灰白组织一件，长径1.0cm，切面灰白色"</td></tr>
                        <tr><td> "女"</td><td> "43岁"</td><td> "发现右后臂包块1年余。",</td><td> "右后臂包块", </td><td> "（右后臂）囊性结节一枚，大小为3.5厘米*2.0厘米*1.5厘米，壁厚0.1厘米-0.2厘米，内含黄色米粒样物，内壁光滑，袋内另见皮肤组织一件，大小为3.0厘米*0.6厘米*0.5厘米，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "46岁"</td><td> "外阴异常增生赘生物两年，近一月快速增大。",</td><td> "外阴赘生物", </td><td> "黏膜样组织一件，大小为1.5厘米*1.0厘米*0.5厘米，黏膜中央见一大小0.5厘米*0.5厘米的灰白色区域，切面灰白，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "39岁"</td><td> "剖宫产中剜除子宫前壁肌瘤。",</td><td> "妊娠合并子宫肌瘤", </td><td> "（子宫）灰白色不规则结节状标本一件，大小为7.5cm*6.5cm*5.5cm，切面灰白色，编织状，质地韧。"</td></tr>
                        <tr><td> "女"</td><td> "51岁"</td><td> "直肠粘膜见一息肉样隆起，广基，圆形，大小约1.2cm*1.2cm，表面光滑，质软，行高频电刀电凝电切术。",</td><td> "直肠息肉样隆起", </td><td> "（直肠）灰白间灰红色小组织一枚，大小为0.4cm*0.4cm*0.2cm，切面灰白间灰红色，质地韧。"</td></tr>
                        <tr><td> "男"</td><td> "70岁"</td><td> "腹胀腹痛",</td><td> "直肠Ca肝转移", </td><td> "灰白色组织3条，长0.2-0.3cm，另有针尖样大小碎组，全取。"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "右卵巢囊肿大小10.0cm*9.0cm，椭圆形。妊娠史2-0-0-2，LMP：2016-11-29,4-7/30，出血量80.",</td><td> "右侧附件肿块", </td><td> "（右侧卵巢）囊性标本一件，大小为10.5cm*9.0cm*7.0cm，囊内含清亮液体，壁厚0.1cm-1.0cm，内壁上附灰黄颗粒状物数十枚，径0.2cm-0.5cm，另见内壁上附菜花状样物2枚，大小分别为0.9cm*0.6cm*0.4cm及1.2cm*0.6cm*0.5cm，切面灰黄色，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "76岁"</td><td> "2014年发现左眼下睑新生物，生长较快，椭圆形，质软",</td><td> "左眼下睑新生物", </td><td> "灰褐色组织一件，大小1.2×0.8×0.6cm，切面灰红色"</td></tr>
                        <tr><td> "男"</td><td> "25岁"</td><td> "肛内肿物脱出伴间作5年。",</td><td> "混合痔", </td><td> "（肛门）灰白间灰红色黏膜样组织两枚，大小分别为2.5厘米*1.5厘米*0.5厘米、1.0厘米*1.0厘米*0.5厘米。"</td></tr>
                        <tr><td> "女"</td><td> "31岁"</td><td> "因发现颈部包块1年余入院，CT示：左侧颈动脉鞘区占位，考虑1、血管源性病变，血管瘤？2、神经源性肿瘤？",</td><td> "左颈部肿物性质待查", </td><td> "结节状组织一枚6*3.5*3cm，已切开，切面灰白灰红，质中。"</td></tr>
                        <tr><td> "女"</td><td> "69岁"</td><td> "右唇部大小1.3×1.3cm肿物，表面见黑痣，长有毛发，质韧，无触痛",</td><td> "右唇部肿块", </td><td> "皮肤组织一件，1.3×1.2×0.8cm，部分区域呈细乳头状，全取"</td></tr>
                        <tr><td> "女"</td><td> "26岁"</td><td> "未提供临床病史。。",</td><td> "左肾占位", </td><td> "无"</td></tr>
                        <tr><td> "女"</td><td> "46岁"</td><td> "发现右胸壁包块1年余。",</td><td> "右胸壁包块", </td><td> "（右胸壁）灰白色不规则附皮组织一枚，大小为1.0厘米*0.6厘米*0.5厘米，切面灰白色，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "44岁"</td><td> "左乳肿物2年余左侧乳腺腋窝可见5×3cm肿块一个，界清",</td><td> "左乳腋窝脂肪瘤", </td><td> "（左侧乳腺腋窝）灰红色组织一个，大小6.0×4.5×2.0cm，切面见一肿物，直径5.0cm，灰红色，质嫩，边界清楚。组织表面见4个淋巴结附着，直径0.5cm~1.0cm。"</td></tr>
                        <tr><td> "女"</td><td> "21岁"</td><td> "右锁骨下包块切除",</td><td> "右锁骨下包块", </td><td> "（右锁骨下）皮肤组织一枚，大小为1.4厘米*0.5厘米*0.4厘米，皮肤中央见一大小0.7厘米*0.7厘米*0.3厘米的灰褐色隆起，隆起部分凹凸不平。"</td></tr>
                        <tr><td> "女"</td><td> "70岁"</td><td> "右耳后包块大小2*1cm及0.5*0.5cm，压痛，界清",</td><td> "腮腺肿物", </td><td> "无"</td></tr>
                        <tr><td> "男"</td><td> "45岁"</td><td> "会阴部皮肤表面赘生物，长径约0.5cm",</td><td> "会阴部肿块", </td><td> "附皮肤组织一件，大小2.5×1.5×1.0cm，表面见一0.5cm的隆起性肿块"</td></tr>
                        <tr><td> "男"</td><td> "32岁"</td><td> "发现HBSAg（+）15年，乏力、纳差1周入院，HBV DNA定量阳性",</td><td> "慢性乙型肝炎", </td><td> "穿刺条2条，长径0.8-1.0cm"</td></tr>
                        <tr><td> "男"</td><td> "78岁"</td><td> "体检发现血PSA升高1月；PSA235.92ng/ml,fpsa34.12ng/ml",</td><td> "前列腺癌？膀胱癌？", </td><td> "穿刺组织，14条，长0.4cm-0.7cm,径均0.1cm"</td></tr>
                        <tr><td> "男"</td><td> "61岁"</td><td> "发现PSA增高1天",</td><td> "前列腺增生", </td><td> "原单位未提供"</td></tr>
                        <tr><td> "女"</td><td> "45岁"</td><td> "发现颈部肿块入院，我院B超示双侧甲状腺占位",</td><td> "双侧甲状腺占位", </td><td> "右侧甲状腺：灰红不规则组织一件，大小4×3×2.2cm，切面见一灰白结节，大小2×2×1.5cm，质硬，界限不清"</td></tr>
                        <tr><td> "男"</td><td> "72岁"</td><td> "术中见右侧睾丸及附睾体积增大",</td><td> "右侧睾丸肿物性质待查、附睾炎", </td><td> "睾丸组织11.5*7*4cm，局灶可见出血及坏死。"</td></tr>
                        <tr><td> "女"</td><td> "27岁"</td><td> "右乳内下象限5点位置，质韧，活动度大，可推动，无压痛。",</td><td> "右乳包块", </td><td> "（右乳）灰白间灰红色结节一枚，大小为2.0厘米*1.5厘米*1.0厘米，包膜完整，切面灰白间灰红色，质地中等。"</td></tr>
                        <tr><td> "男"</td><td> "15岁"</td><td> "右颈部淋巴结肿块1年余，近期感觉稍稍增大，右颈部仅1个肿大淋巴结，无发热，乏力等症状",</td><td> "右颈部淋巴结肿大", </td><td> "灰白结节一枚，包膜完整，1.5×1.5×0.5cm，切面灰白"</td></tr>
                        <tr><td> "女"</td><td> "49岁"</td><td> "阴道不规则流血，原因待查！",</td><td> "阴道不规则出血待查", </td><td> "灰白碎组织一堆，1cm×1cm×0.5cm"</td></tr>
                        <tr><td> "女"</td><td> "76岁"</td><td> "发现肺占位1月，CT示作肺占位，行肺穿刺3条活检组织，肉眼见坏死组织。",</td><td> "肺CA？", </td><td> "（肺）针管样小组织3条，长1.0cm-1.5cm，直径0.1cm。"</td></tr>
                        <tr><td> "男"</td><td> "69岁"</td><td> "距肛缘约22cm处见不规则隆起病灶，马蹄形，大小约3.5cm*3.5cm，表面不平，露有秽苔，质稍硬，活检易出血。",</td><td> "乙状结肠癌？", </td><td> "灰白间灰红色小组织六枚，大小分别为0.2cm*0.1cm*0.1cm四枚及0.1cm*0.1cm*0.1cm两枚。"</td></tr>
                        <tr><td> "女"</td><td> "64岁"</td><td> "发现尿道口新生物伴出血2月。",</td><td> "尿道肉阜", </td><td> "（尿道外口）灰白间灰红色息肉样小组织一枚，大小为1.0cm*1.0cm*0.5cm，切面灰白间灰红色，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "30岁"</td><td> "右侧颞部5×4cm大小肿物，鱼肉状，质软，边界不清，包膜不完整，全身多发结节，沿神经干生长",</td><td> "右颞部肿物", </td><td> "灰红结节一枚，4.5×3.5×1.5cm，无完整包膜，切面灰红、灰白、灰黄，质地细腻，呈胶冻状"</td></tr>
                        <tr><td> "男"</td><td> "46岁"</td><td> "声嘶4-5个月，左侧声带前1/3可见新生物，表面不平",</td><td> "右声带肿瘤", </td><td> "灰白小组织2粒，长径0.1-0.2cm"</td></tr>
                        <tr><td> "女"</td><td> "40岁"</td><td> "B超发现左乳肿块，行旋切术",</td><td> "左乳肿块", </td><td> "灰白碎组织一堆，长径3cm"</td></tr>
                        <tr><td> "女"</td><td> "59岁"</td><td> "咳嗽、咳痰一月余CT示：双肺多发结节，肿瘤标记物偏高；糖尿病史；PPD阴性，血TISPOT阳性；乳腺与甲状腺均有结节，后附彩超单",</td><td> "左肺多发转移性肿瘤", </td><td> "尖帽大组织，一粒，径0.2cm;针尖大组织，四粒，径均0.1cm"</td></tr>
                        <tr><td> "男"</td><td> "28岁"</td><td> "发现左膝包块一年，术中见筋膜下一大小约4.0cm*3.0cm囊性组织，内容物为淡黄色粘稠液体。",</td><td> "左膝囊肿", </td><td> "（左膝）囊样标本一件，大小为3.0cm*2.0cm*0.5cm，囊内含胶冻样物，壁厚0.1cm。"</td></tr>
                        <tr><td> "女"</td><td> "59岁"</td><td> "绝经5年，阴道少量出血1年余，间断反复发生，外院子宫附件B超：子宫内膜厚7mm。",</td><td> "子宫内膜病变", </td><td> "（宫腔）灰白间灰红色碎组织一堆，大小共3.0厘米*2.0厘米*0.7厘米。"</td></tr>
                        <tr><td> "男"</td><td> "63岁"</td><td> "乙状结肠（距肛缘约20厘米处）见一长条状息肉样隆起，长约2.0厘米，宽约0.4厘米，表面光滑，底部稍充血。",</td><td> "乙状结肠息肉样隆起", </td><td> "（乙状结肠）灰白间灰红色小组织一枚，大小为1.0厘米*0.3厘米*0.2厘米。"</td></tr>
                        <tr><td> "男"</td><td> "65岁"</td><td> "发现左眼内囊区肿物5月余，术中见肿物质稍韧。，15年1月和12月份诊断（左颧面部）孤立性纤维性肿瘤",</td><td> "左泪囊区肿物", </td><td> "灰红碎组织一堆，0.8×0.5×0.2cm，全取。"</td></tr>
                        <tr><td> "女"</td><td> "63岁"</td><td> "左腮腺前、后见肿物两枚，与周围组织粘连",</td><td> "左腮腺肿物", </td><td> "左腮腺（前）肿物 结节状肿物一件，长径1.0cm，包膜完整，切面囊实性，实性区域灰白色，囊性区域含胶冻状物,左腮腺（后）肿物 灰红组织一件，大小2.0×1.0×1.0cm,切面见一径1.0cm的结节，结节切面呈灰白色"</td></tr>
                        <tr><td> "男"</td><td> "61岁"</td><td> "左上颌牙龈肿物呈外生型，质中，不活动，边界一般，表面伴破溃",</td><td> "左上颌牙龈肿物", </td><td> "灰白附黏膜组织一块，长径1.5cm，切面灰白色，质韧"</td></tr>
                        <tr><td> "男"</td><td> "64岁"</td><td> "直肠距肛缘7cm处见一径4.5cm的息肉状肿物，表面呈细乳头状，无明确蒂，上海同济医院活检示：管状绒毛状腺瘤",</td><td> "直肠腺瘤", </td><td> "(直肠）灰红结节一枚，4.5×2.0×2.0cm，表面呈细乳头状，根部未见明确蒂。"</td></tr>
                        <tr><td> "女"</td><td> "63岁"</td><td> "发现肺部占位7天。胸部CT：左肺下叶肿物，伴纵隔内及双肺门多发肿大淋巴结。",</td><td> "肺部占位", </td><td> "灰红色凝血样组织，直径2.0cm"</td></tr>
                        <tr><td> "男"</td><td> "31岁"</td><td> "反复左侧纳差伴流涕半年余，加重一周入院。左鼻腔粘膜肿胀，下鼻甲后段可见白色新生物，易出血",</td><td> "左鼻腔新生物", </td><td> "灰红碎组织一堆，长径2.0cm"</td></tr>
                        <tr><td> "男"</td><td> "46岁"</td><td> "右侧阴囊渐增大一年余。",</td><td> "右睾丸鞘膜积液", </td><td> "（右睾丸鞘膜）囊壁样组织两件，大小分别为4.0厘米*2.5厘米*1.5厘米，3.0厘米*2.0厘米*1.0厘米。"</td></tr>
                        <tr><td> "男"</td><td> "61岁"</td><td> "发现左腹股沟肿物两月余。既往有“黑色素瘤”病史。三年前因“左腹股沟内侧肿物”在我院手术治疗。10月前因“右腹股沟斜疝”在我院手术治疗。左腹股沟可触及一肿物，质韧，约1.5*1.2cm，表面光滑，无压痛，活动度欠佳。",</td><td> "左腹股沟肿物性质待查", </td><td> "左腹股沟灰红色组织一块，大小2.0*1.5cm"</td></tr>
                        <tr><td> "女"</td><td> "29岁"</td><td> "右手包块3个月，右第三四掌指关节掌侧可触及一直径3.0cm包块、质韧，边界清楚，推之不动，局部压痛明显，功能活动基本正常，CT示右手掌侧圆形包块，包膜完整，边界清楚。",</td><td> "右手包块", </td><td> "（右手）灰白碎组织一堆，大小共2.0cm*1.5cm*0.5cm。"</td></tr>
                        <tr><td> "女"</td><td> "49岁"</td><td> "距肛缘约4厘米处见不规则隆起病灶，环绕管腔近二分之一，表面不平，露秽苔，质脆，易出血。",</td><td> "直肠CA?", </td><td> "灰白间灰红色小组织六枚，大小分别为0.3厘米*0.2厘米*0.1厘米四枚，0.1厘米*0.1厘米*0.1厘米两枚，质地中等。"</td></tr>
                        <tr><td> "女"</td><td> "62岁"</td><td> "反复肝功能异常一年余，抗核抗体临界阳性（1</td><td>100）",</td><td> "药物性肝炎", </td></tr>
                        <tr><td> "女"</td><td> "69岁"</td><td> "阴道不规则出血2月余。",</td><td> "子宫内膜癌？", </td><td> "全子宫标本：宫体大小约：9x8x5.5cm，宫颈长：3cm，外侧径长：3.5cm，切面宫腔深：10cm，内膜厚：0.1cm，与内膜相连可见灰红、灰褐色结节一枚，大小约：10x6x5cm，切面灰褐、暗红色，质中。"</td></tr>
                        </tbody>
                        <!--                            <tfoot>-->
                        <!--                                <tr>-->
                        <!--                                    <th>渲染引擎</th>-->
                        <!--                                    <th>浏览器</th>-->
                        <!--                                    <th>平台</th>-->
                        <!--                                    <th>引擎版本</th>-->
                        <!--                                    <th>CSS等级</th>-->
                        <!--                                </tr>-->
                        <!--                            </tfoot>-->
                    </table>

                </div>
            </div>
        </div>
    </div>

</div>

<!-- 全局js -->
<script src="<%=path%>/js/jquery.min.js?v=2.1.4"></script>
<script src="<%=path%>/js/bootstrap.min.js?v=3.3.6"></script>



<script src="<%=path%>/js/plugins/jeditable/jquery.jeditable.js"></script>

<!-- Data Tables -->
<script src="<%=path%>/js/plugins/dataTables/jquery.dataTables.js"></script>
<script src="<%=path%>/js/plugins/dataTables/dataTables.bootstrap.js"></script>

<!-- 自定义js -->
<script src="<%=path%>/js/content.js?v=1.0.0"></script>


<!-- Page-Level Scripts -->
<script>
    $(document).ready(function () {
        $('.dataTables-example').dataTable();

        /* Init DataTables */
        var oTable = $('#editable').dataTable();

        /* Apply the jEditable handlers to the table */
        oTable.$('td').editable('../example_ajax.php', {
            "callback": function (sValue, y) {
                var aPos = oTable.fnGetPosition(this);
                oTable.fnUpdate(sValue, aPos[0], aPos[1]);
            },
            "submitdata": function (value, settings) {
                return {
                    "row_id": this.parentNode.getAttribute('id'),
                    "column": oTable.fnGetPosition(this)[2]
                };
            },

            "width": "90%",
            "height": "100%"
        });


    });

    function fnClickAddRow() {
        $('#editable').dataTable().fnAddData([
            "Custom row",
            "New row",
            "New row",
            "New row",
            "New row"]);

    }
</script>




</body>

</html>
