<%--<!DOCTYPE html>--%>
<%@ page contentType="text/html;charset=UTF-8" language="java" %>
<% String path = request.getContextPath(); %>
<%@ taglib  prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<html>

<head>

    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <script type='text/javascript' src='<%=path%>/js/echarts.min.js' charset='utf-8'></script>

    <title>2019-nCoV</title>
    <meta name="keywords" content="">
    <meta name="description" content="">

    <link rel="shortcut icon" href="<%=path%>/favicon.ico"> <link href="<%=path%>/css/bootstrap.min.css?v=3.3.6" rel="stylesheet">
    <link href="<%=path%>/css/font-awesome.css?v=4.4.0" rel="stylesheet">
    <link href="<%=path%>/css/animate.css" rel="stylesheet">
    <link href="<%=path%>/css/style.css?v=4.1.0" rel="stylesheet">



</head>

<body class="gray-bg">
<div class="wrapper wrapper-content">
    <div class="row animated fadeInRight">
        <div class="col-sm-4">
            <div class="ibox float-e-margins">
                <div class="ibox-title">
                    <h5>聚集性传染病：2019-nCoV介绍</h5>
                </div>
                <div>
                    <div class="ibox-content no-padding border-left-right">
                        <img alt="image" class="img-responsive" src="<%=path%>/img/2019-ncov.jpg">
                    </div>
                    <div class="ibox-content profile-content">
                        <!--                            <h4><strong>Beaut-zihan</strong></h4>-->
                        <!--                            <p><i class="fa fa-map-marker"></i> 上海市闵行区绿地科技岛广场A座2606室</p>-->
                        <!--                            <h5>-->
                        <!--                                    关于我-->
                        <!--                                </h5>-->
                        <p>
                            2019新型冠状病毒，2020年1月12日，世界卫生组织正式将其命名为2019-nCoV 。冠状病毒是一个大型病毒家族，已知可引起感冒以及中东呼吸综合征(MERS)和严重急性呼吸综合征(SARS)等较严重疾病。新型冠状病毒是以前从未在人体中发现的冠状病毒新毒株 。
                            2019年12月以来，湖北省武汉市持续开展流感及相关疾病监测，发现多起病毒性肺炎病例，均诊断为病毒性肺炎/肺部感染。
                            人感染了冠状病毒后常见体征有呼吸道症状、发热、咳嗽、气促和呼吸困难等。在较严重病例中，感染可导致肺炎、严重急性呼吸综合征、肾衰竭，甚至死亡。对于新型冠状病毒所致疾病没有特异治疗方法。但许多症状是可以处理的，因此需根据患者临床情况进行治疗。此外，对感染者的辅助护理可能非常有效。做好自我保护包括:保持基本的手部和呼吸道卫生，坚持安全饮食习惯，并尽可能避免与任何表现出有呼吸道疾病症状(如咳嗽和打喷嚏等)的人密切接触。

                        </p>
                    </div>
                </div>
            </div>
        </div>
        <div class="col-sm-8">
            <div class="ibox float-e-margins">

                <div class="ibox-content">

                    <div>
                        <div class="feed-activity-list">
                            <div class="row">
                                <div  style="padding-right:0;">
                                    <div class="ibox float-e-margins">
                                        <div class="ibox-title" style="border-bottom:none;background:#fff;text-align:center">
                                            <h2>中国疫情实时数据</h2>
                                        </div>
                                        <br>
                                        <div class="ibox-content" style="border-top:none;">
                                            <div style="height:470px;">

                                                <div id="main" style="display:inline-block;height:250px;width:380px;"></div>
                                                <!--                                    <div style="display:inline-block;height:200px;width:10px"></div>-->
                                                <div id="main1" style="display:inline-block;height:250px;width:380px"></div>

                                                <!--                                    <div style="display:inline-block;height:10px;width:920px;background:yellow"></div>-->

                                                <div id="main2" style="display:inline-block;height:250px;width:380px"></div>
                                                <!--                                    <div style="display:inline-block;height:200px;width:10px;background:yellow"></div>-->
                                                <div id="main3" style="display:inline-block;height:250px;width:380px"></div>

                                                <script type="text/javascript">
                                                    window.onload = function () {
                                                        echart01();
                                                        echart02();
                                                        echart03();
                                                        echart04();

                                                        function echart01() {
                                                            // 基于准备好的dom，初始化echarts实例
                                                            var myChart = echarts.init(document.getElementById('main'));
                                                            var option;

                                                            function randomData() {
                                                                now = new Date(+now + oneDay);
                                                                value = value + Math.random() * 21 - 10;
                                                                return {
                                                                    name: now.toString(),
                                                                    value: [
                                                                        [now.getFullYear(), now.getMonth() + 1, now.getDate()].join('/'),
                                                                        Math.round(value)
                                                                    ]
                                                                };
                                                            }

                                                            var data = [];
                                                            var now = +new Date(1997, 9, 3);
                                                            var oneDay = 24 * 3600 * 1000;
                                                            var value = Math.random() * 1000;
                                                            for (var i = 0; i < 1000; i++) {
                                                                data.push(randomData());
                                                            }

                                                            option = {
                                                                title: {
                                                                    left: 'center',
                                                                    text: '动态数据 + 时间坐标轴'
                                                                },
                                                                tooltip: {
                                                                    trigger: 'axis',
                                                                    formatter: function (params) {
                                                                        params = params[0];
                                                                        var date = new Date(params.name);
                                                                        return date.getDate() + '/' + (date.getMonth() + 1) + '/' + date.getFullYear() + ' : ' + params.value[1];
                                                                    },
                                                                    axisPointer: {
                                                                        animation: false
                                                                    }
                                                                },
                                                                xAxis: {
                                                                    type: 'time',
                                                                    splitLine: {
                                                                        show: false
                                                                    }
                                                                },
                                                                yAxis: {
                                                                    type: 'value',
                                                                    boundaryGap: [0, '100%'],
                                                                    splitLine: {
                                                                        show: false
                                                                    }
                                                                },
                                                                series: [{
                                                                    name: '模拟数据',
                                                                    type: 'line',
                                                                    showSymbol: false,
                                                                    hoverAnimation: false,
                                                                    data: data
                                                                }]
                                                            };

                                                            setInterval(function () {

                                                                for (var i = 0; i < 5; i++) {
                                                                    data.shift();
                                                                    data.push(randomData());
                                                                }

                                                                myChart.setOption({
                                                                    series: [{
                                                                        data: data
                                                                    }]
                                                                });
                                                            }, 1000);
                                                            // 使用刚指定的配置项和数据显示图表。
                                                            myChart.setOption(option);
                                                        }

                                                        function echart02() {
                                                            // 基于准备好的dom，初始化echarts实例
                                                            var myChart = echarts.init(document.getElementById('main1'),"light");

                                                            var option;

                                                            var data = [["2020/1/10",41],
                                                                ["2020/1/11",41],
                                                                ["2020/1/12",41],
                                                                ["2020/1/13",41],
                                                                ["2020/1/14",41],
                                                                ["2020/1/15",41],
                                                                ["2020/1/16",45],
                                                                ["2020/1/17",62],
                                                                ["2020/1/18",121],
                                                                ["2020/1/19",198],
                                                                ["2020/1/20",291],
                                                                ["2020/1/21",440],
                                                                ["2020/1/22",571],
                                                                ["2020/1/23",830],
                                                                ["2020/1/24",1287],
                                                                ["2020/1/25",1975],
                                                                ["2020/1/26",2744],
                                                                ["2020/1/27",4515],
                                                                ["2020/1/28",5974],
                                                                ["2020/1/29",7711],
                                                                ["2020/1/30",9692],
                                                                ["2020/1/31",11791],
                                                                ["2020/2/1",14380],
                                                                ["2020/2/2",17205],
                                                                ["2020/2/3",20438],
                                                                ["2020/2/4",24324],
                                                                ["2020/2/5",28018],
                                                                ["2020/2/6",31161],
                                                                ["2020/2/7",34546],
                                                                ["2020/2/8",37198],
                                                                ["2020/2/9",40171],
                                                                ["2020/2/10",42638],
                                                                ["2020/2/11",44653],
                                                                ["2020/2/12",59804],
                                                                ["2020/2/13",63851],
                                                                ["2020/2/14",66492],
                                                                ["2020/2/15",68500],
                                                                ["2020/2/16",70548],
                                                                ["2020/2/17",72436],
                                                                ["2020/2/18",74185],
                                                                ["2020/2/19",75002],
                                                                ["2020/2/20",75891],
                                                                ["2020/2/21",76288],
                                                                ["2020/2/22",76936],
                                                                ["2020/2/23",77150],
                                                                ["2020/2/24",77658],
                                                                ["2020/2/25",78064],
                                                                ["2020/2/26",78497],
                                                                ["2020/2/27",78824],
                                                                ["2020/2/28",79251],
                                                                ["2020/2/29",79824],
                                                                ["2020/3/1",80026],
                                                                ["2020/3/2",80151],
                                                                ["2020/3/3",80270],
                                                                ["2020/3/4",80409],
                                                                ["2020/3/5",80552],
                                                                ["2020/3/6",80651],
                                                                ["2020/3/7",80695],
                                                                ["2020/3/8",80735],
                                                                ["2020/3/9",80754],
                                                                ["2020/3/10",80778],
                                                                ["2020/3/11",80793],
                                                                ["2020/3/12",80813],
                                                                ["2020/3/13",80824],
                                                                ["2020/3/14",80844],
                                                                ["2020/3/15",80860],
                                                                ["2020/3/16",80881],
                                                                ["2020/3/17",80894],
                                                                ["2020/3/18",80928],
                                                                ["2020/3/19",80967],
                                                                ["2020/3/20",81008],
                                                                ["2020/3/21",81054],
                                                                ["2020/3/22",81093],
                                                                ["2020/3/23",81171],
                                                                ["2020/3/24",81218],
                                                                ["2020/3/25",81285],
                                                                ["2020/3/26",81340],
                                                                ["2020/3/27",81394],
                                                                ["2020/3/28",81439],
                                                                ["2020/3/29",81470],
                                                                ["2020/3/30",81518],
                                                                ["2020/3/31",81554],
                                                                ["2020/4/1",81589],
                                                                ["2020/4/2",81620],
                                                                ["2020/4/3",81639],
                                                                ["2020/4/4",81669],
                                                                ["2020/4/5",81708],
                                                                ["2020/4/6",81740],
                                                                ["2020/4/7",81802],
                                                                ["2020/4/8",81865],
                                                                ["2020/4/9",81907],
                                                                ["2020/4/10",81953],
                                                                ["2020/4/11",82052],
                                                                ["2020/4/12",82160],
                                                                ["2020/4/13",82249],
                                                                ["2020/4/14",82295],
                                                                ["2020/4/15",82341],
                                                                ["2020/4/16",82367],
                                                                ["2020/4/17",82719],
                                                                ["2020/4/18",82735],
                                                                ["2020/4/19",82747],
                                                                ["2020/4/20",82758],
                                                                ["2020/4/21",82788],
                                                                ["2020/4/22",82798],
                                                                ["2020/4/23",82804],
                                                                ["2020/4/24",82816],
                                                                ["2020/4/25",82827],
                                                                ["2020/4/26",82830],
                                                                ["2020/4/27",82836],
                                                                ["2020/4/28",82858],
                                                                ["2020/4/29",82862],
                                                                ["2020/4/30",82874],
                                                                ["2020/5/1",82875],
                                                                ["2020/5/2",82877],
                                                                ["2020/5/3",82880],
                                                                ["2020/5/4",82881],
                                                                ["2020/5/5",82883],
                                                                ["2020/5/6",82885],
                                                                ["2020/5/7",82886],
                                                                ["2020/5/8",82887],
                                                                ["2020/5/9",82901],
                                                                ["2020/5/10",82918],
                                                                ["2020/5/11",82919],
                                                                ["2020/5/12",82926],
                                                                ["2020/5/13",82929],
                                                                ["2020/5/14",82933],
                                                                ["2020/5/15",82941],
                                                                ["2020/5/16",82947],
                                                                ["2020/5/17",82954],
                                                                ["2020/5/18",82960],
                                                                ["2020/5/19",82965],
                                                                ["2020/5/20",82967],
                                                                ["2020/5/21",82971],
                                                                ["2020/5/22",82971],
                                                                ["2020/5/23",82974],
                                                                ["2020/5/24",82985],
                                                                ["2020/5/25",82992],
                                                                ["2020/5/27",82995],
                                                                ["2020/5/28",82995],
                                                                ["2020/5/29",82999],
                                                                ["2020/5/30",83001],
                                                                ["2020/5/31",83017],
                                                                ["2020/6/1",83022],
                                                                ["2020/6/2",83021],
                                                                ["2020/6/3",83022],
                                                                ["2020/6/4",83024],
                                                                ["2020/6/5",83030],
                                                                ["2020/6/6",83036],
                                                                ["2020/6/7",83040],
                                                                ["2020/6/8",83043],
                                                                ["2020/6/9",83046],
                                                                ["2020/6/10",83057],
                                                                ["2020/6/11",83064],
                                                                ["2020/6/12",83075],
                                                                ["2020/6/13",83132],
                                                                ["2020/6/14",83181],
                                                                ["2020/6/15",83221],
                                                                ["2020/6/16",83265],
                                                                ["2020/6/17",83293],
                                                                ["2020/6/18",83325],
                                                                ["2020/6/19",83352],
                                                                ["2020/6/20",83378],
                                                                ["2020/6/21",83396],
                                                                ["2020/6/22",83418],
                                                                ["2020/6/23",83430],
                                                                ["2020/6/24",83449],
                                                                ["2020/6/25",83462],
                                                                ["2020/6/26",83483],
                                                                ["2020/6/27",83500],
                                                                ["2020/6/28",83512],
                                                                ["2020/6/29",83531],
                                                                ["2020/6/30",83534],
                                                                ["2020/7/1",83537],
                                                                ["2020/7/2",83542],
                                                                ["2020/7/3",83545],
                                                                ["2020/7/4",83553],
                                                                ["2020/7/5",83557],
                                                                ["2020/7/6",83565],
                                                                ["2020/7/7",83572],
                                                                ["2020/7/8",83581],
                                                                ["2020/7/9",83585],
                                                                ["2020/7/10",83587],
                                                                ["2020/7/11",83594],
                                                                ["2020/7/12",83602],
                                                                ["2020/7/13",83605],
                                                                ["2020/7/14",83611],
                                                                ["2020/7/15",83612],
                                                                ["2020/7/16",83622],
                                                                ["2020/7/17",83644],
                                                                ["2020/7/18",83660],
                                                                ["2020/7/19",83682],
                                                                ["2020/7/20",83693],
                                                                ["2020/7/21",83707],
                                                                ["2020/7/22",83729],
                                                                ["2020/7/23",83750],
                                                                ["2020/7/24",83784],
                                                                ["2020/7/25",83830],
                                                                ["2020/7/26",83891],
                                                                ["2020/7/27",83959],
                                                                ["2020/7/28",84060],
                                                                ["2020/7/29",84165],
                                                                ["2020/7/30",84292],
                                                                ["2020/7/31",84337],
                                                                ["2020/8/1",84385],
                                                                ["2020/8/2",84428],
                                                                ["2020/8/3",84464],
                                                                ["2020/8/4",84491],
                                                                ["2020/8/5",84528],
                                                                ["2020/8/6",84565],
                                                                ["2020/8/7",84596],
                                                                ["2020/8/8",84619],
                                                                ["2020/8/9",84668],
                                                                ["2020/8/10",84712],
                                                                ["2020/8/11",84737],
                                                                ["2020/8/12",84756],
                                                                ["2020/8/13",84786],
                                                                ["2020/8/14",84808],
                                                                ["2020/8/15",84827],
                                                                ["2020/8/16",84849],
                                                                ["2020/8/17",84871],
                                                                ["2020/8/18",84888],
                                                                ["2020/8/19",84895],]
                                                            var dateList = data.map(function (item) {
                                                                return item[0];
                                                            });
                                                            var valueList = data.map(function (item) {
                                                                return item[1];
                                                            });

                                                            option = {

                                                                // Make gradient line here
                                                                visualMap: [{
                                                                    show: false,
                                                                    type: 'continuous',
                                                                    seriesIndex: 0,
                                                                    min: 0,
                                                                    max: 400
                                                                }],


                                                                title: [{
                                                                    left: 'center',
                                                                    text: '2019-nCoV患病人数'
                                                                }],
                                                                tooltip: {
                                                                    trigger: 'axis'
                                                                },
                                                                xAxis: [{
                                                                    data: dateList
                                                                }],
                                                                yAxis: [{
                                                                }],
                                                                // grid: [{
                                                                //     bottom: '60%'
                                                                // }, {
                                                                //     top: '60%'
                                                                // }],
                                                                series: [{
                                                                    type: 'line',
                                                                    showSymbol: false,
                                                                    data: valueList
                                                                }]
                                                            };

                                                            option && myChart.setOption(option);
                                                        }
                                                        function echart03() {
                                                            // 基于准备好的dom，初始化echarts实例
                                                            var myChart = echarts.init(document.getElementById('main2'),"light");

                                                            var option;

                                                            var data = [["2020/1/10",1],
                                                                ["2020/1/11",1],
                                                                ["2020/1/12",1],
                                                                ["2020/1/13",1],
                                                                ["2020/1/14",1],
                                                                ["2020/1/15",2],
                                                                ["2020/1/16",2],
                                                                ["2020/1/17",2],
                                                                ["2020/1/18",3],
                                                                ["2020/1/19",3],
                                                                ["2020/1/20",3],
                                                                ["2020/1/21",9],
                                                                ["2020/1/22",17],
                                                                ["2020/1/23",25],
                                                                ["2020/1/24",41],
                                                                ["2020/1/25",56],
                                                                ["2020/1/26",80],
                                                                ["2020/1/27",106],
                                                                ["2020/1/28",132],
                                                                ["2020/1/29",170],
                                                                ["2020/1/30",213],
                                                                ["2020/1/31",259],
                                                                ["2020/2/1",304],
                                                                ["2020/2/2",361],
                                                                ["2020/2/3",425],
                                                                ["2020/2/4",490],
                                                                ["2020/2/5",563],
                                                                ["2020/2/6",636],
                                                                ["2020/2/7",722],
                                                                ["2020/2/8",811],
                                                                ["2020/2/9",908],
                                                                ["2020/2/10",1016],
                                                                ["2020/2/11",1113],
                                                                ["2020/2/12",1367],
                                                                ["2020/2/13",1380],
                                                                ["2020/2/14",1523],
                                                                ["2020/2/15",1665],
                                                                ["2020/2/16",1770],
                                                                ["2020/2/17",1868],
                                                                ["2020/2/18",2004],
                                                                ["2020/2/19",2118],
                                                                ["2020/2/20",2236],
                                                                ["2020/2/21",2345],
                                                                ["2020/2/22",2442],
                                                                ["2020/2/23",2592],
                                                                ["2020/2/24",2663],
                                                                ["2020/2/25",2715],
                                                                ["2020/2/26",2744],
                                                                ["2020/2/27",2788],
                                                                ["2020/2/28",2835],
                                                                ["2020/2/29",2870],
                                                                ["2020/3/1",2912],
                                                                ["2020/3/2",2943],
                                                                ["2020/3/3",2981],
                                                                ["2020/3/4",3012],
                                                                ["2020/3/5",3042],
                                                                ["2020/3/6",3070],
                                                                ["2020/3/7",3097],
                                                                ["2020/3/8",3119],
                                                                ["2020/3/9",3136],
                                                                ["2020/3/10",3158],
                                                                ["2020/3/11",3169],
                                                                ["2020/3/12",3176],
                                                                ["2020/3/13",3189],
                                                                ["2020/3/14",3199],
                                                                ["2020/3/15",3213],
                                                                ["2020/3/16",3226],
                                                                ["2020/3/17",3237],
                                                                ["2020/3/18",3245],
                                                                ["2020/3/19",3248],
                                                                ["2020/3/20",3255],
                                                                ["2020/3/21",3261],
                                                                ["2020/3/22",3270],
                                                                ["2020/3/23",3277],
                                                                ["2020/3/24",3281],
                                                                ["2020/3/25",3287],
                                                                ["2020/3/26",3292],
                                                                ["2020/3/27",3295],
                                                                ["2020/3/28",3300],
                                                                ["2020/3/29",3304],
                                                                ["2020/3/30",3305],
                                                                ["2020/3/31",3312],
                                                                ["2020/4/1",3318],
                                                                ["2020/4/2",3322],
                                                                ["2020/4/3",3326],
                                                                ["2020/4/4",3329],
                                                                ["2020/4/5",3331],
                                                                ["2020/4/6",3331],
                                                                ["2020/4/7",3333],
                                                                ["2020/4/8",3335],
                                                                ["2020/4/9",3336],
                                                                ["2020/4/10",3339],
                                                                ["2020/4/11",3339],
                                                                ["2020/4/12",3341],
                                                                ["2020/4/13",3341],
                                                                ["2020/4/14",3342],
                                                                ["2020/4/15",3342],
                                                                ["2020/4/16",3342],
                                                                ["2020/4/17",4632],
                                                                ["2020/4/18",4632],
                                                                ["2020/4/19",4632],
                                                                ["2020/4/20",4632],
                                                                ["2020/4/21",4632],
                                                                ["2020/4/22",4632],
                                                                ["2020/4/23",4632],
                                                                ["2020/4/24",4632],
                                                                ["2020/4/25",4632],
                                                                ["2020/4/26",4633],
                                                                ["2020/4/27",4633],
                                                                ["2020/4/28",4633],
                                                                ["2020/4/29",4633],
                                                                ["2020/4/30",4633],
                                                                ["2020/5/1",4633],
                                                                ["2020/5/2",4633],
                                                                ["2020/5/3",4633],
                                                                ["2020/5/4",4633],
                                                                ["2020/5/5",4633],
                                                                ["2020/5/6",4633],
                                                                ["2020/5/7",4633],
                                                                ["2020/5/8",4633],
                                                                ["2020/5/9",4633],
                                                                ["2020/5/10",4633],
                                                                ["2020/5/11",4633],
                                                                ["2020/5/12",4633],
                                                                ["2020/5/13",4633],
                                                                ["2020/5/14",4633],
                                                                ["2020/5/15",4633],
                                                                ["2020/5/16",4634],
                                                                ["2020/5/17",4634],
                                                                ["2020/5/18",4634],
                                                                ["2020/5/19",4634],
                                                                ["2020/5/20",4634],
                                                                ["2020/5/21",4634],
                                                                ["2020/5/22",4634],
                                                                ["2020/5/23",4634],
                                                                ["2020/5/24",4634],
                                                                ["2020/5/25",4634],
                                                                ["2020/5/27",4634],
                                                                ["2020/5/28",4634],
                                                                ["2020/5/29",4634],
                                                                ["2020/5/30",4634],
                                                                ["2020/5/31",4634],
                                                                ["2020/6/1",4634],
                                                                ["2020/6/2",4634],
                                                                ["2020/6/3",4634],
                                                                ["2020/6/4",4634],
                                                                ["2020/6/5",4634],
                                                                ["2020/6/6",4634],
                                                                ["2020/6/7",4634],
                                                                ["2020/6/8",4634],
                                                                ["2020/6/9",4634],
                                                                ["2020/6/10",4634],
                                                                ["2020/6/11",4634],
                                                                ["2020/6/12",4634],
                                                                ["2020/6/13",4634],
                                                                ["2020/6/14",4634],
                                                                ["2020/6/15",4634],
                                                                ["2020/6/16",4634],
                                                                ["2020/6/17",4634],
                                                                ["2020/6/18",4634],
                                                                ["2020/6/19",4634],
                                                                ["2020/6/20",4634],
                                                                ["2020/6/21",4634],
                                                                ["2020/6/22",4634],
                                                                ["2020/6/23",4634],
                                                                ["2020/6/24",4634],
                                                                ["2020/6/25",4634],
                                                                ["2020/6/26",4634],
                                                                ["2020/6/27",4634],
                                                                ["2020/6/28",4634],
                                                                ["2020/6/29",4634],
                                                                ["2020/6/30",4634],
                                                                ["2020/7/1",4634],
                                                                ["2020/7/2",4634],
                                                                ["2020/7/3",4634],
                                                                ["2020/7/4",4634],
                                                                ["2020/7/5",4634],
                                                                ["2020/7/6",4634],
                                                                ["2020/7/7",4634],
                                                                ["2020/7/8",4634],
                                                                ["2020/7/9",4634],
                                                                ["2020/7/10",4634],
                                                                ["2020/7/11",4634],
                                                                ["2020/7/12",4634],
                                                                ["2020/7/13",4634],
                                                                ["2020/7/14",4634],
                                                                ["2020/7/15",4634],
                                                                ["2020/7/16",4634],
                                                                ["2020/7/17",4634],
                                                                ["2020/7/18",4634],
                                                                ["2020/7/19",4634],
                                                                ["2020/7/20",4634],
                                                                ["2020/7/21",4634],
                                                                ["2020/7/22",4634],
                                                                ["2020/7/23",4634],
                                                                ["2020/7/24",4634],
                                                                ["2020/7/25",4634],
                                                                ["2020/7/26",4634],
                                                                ["2020/7/27",4634],
                                                                ["2020/7/28",4634],
                                                                ["2020/7/29",4634],
                                                                ["2020/7/30",4634],
                                                                ["2020/7/31",4634],
                                                                ["2020/8/1",4634],
                                                                ["2020/8/2",4634],
                                                                ["2020/8/3",4634],
                                                                ["2020/8/4",4634],
                                                                ["2020/8/5",4634],
                                                                ["2020/8/6",4634],
                                                                ["2020/8/7",4634],
                                                                ["2020/8/8",4634],
                                                                ["2020/8/9",4634],
                                                                ["2020/8/10",4634],
                                                                ["2020/8/11",4634],
                                                                ["2020/8/12",4634],
                                                                ["2020/8/13",4634],
                                                                ["2020/8/14",4634],
                                                                ["2020/8/15",4634],
                                                                ["2020/8/16",4634],
                                                                ["2020/8/17",4634],
                                                                ["2020/8/18",4634],
                                                                ["2020/8/19",4634],]
                                                            var dateList = data.map(function (item) {
                                                                return item[0];
                                                            });
                                                            var valueList = data.map(function (item) {
                                                                return item[1];
                                                            });

                                                            option = {

                                                                // Make gradient line here
                                                                visualMap: [{
                                                                    show: false,
                                                                    type: 'continuous',
                                                                    seriesIndex: 0,
                                                                    min: 0,
                                                                    max: 400
                                                                }],


                                                                title: [{
                                                                    left: 'center',
                                                                    text: '2019-nCoV死亡人数'
                                                                }],
                                                                tooltip: {
                                                                    trigger: 'axis'
                                                                },
                                                                xAxis: [{
                                                                    data: dateList
                                                                }],
                                                                yAxis: [{
                                                                }],
                                                                // grid: [{
                                                                //     bottom: '60%'
                                                                // }, {
                                                                //     top: '60%'
                                                                // }],
                                                                series: [{
                                                                    type: 'line',
                                                                    showSymbol: false,
                                                                    data: valueList
                                                                }]
                                                            };

                                                            option && myChart.setOption(option);
                                                        }
                                                        function echart04() {
                                                            // 基于准备好的dom，初始化echarts实例
                                                            var myChart = echarts.init(document.getElementById('main3'),"light");

                                                            var option;

                                                            var data =[["2020/1/10",2],
                                                                ["2020/1/11",6],
                                                                ["2020/1/12",7],
                                                                ["2020/1/13",7],
                                                                ["2020/1/14",7],
                                                                ["2020/1/15",12],
                                                                ["2020/1/16",15],
                                                                ["2020/1/17",19],
                                                                ["2020/1/18",24],
                                                                ["2020/1/19",25],
                                                                ["2020/1/20",25],
                                                                ["2020/1/21",25],
                                                                ["2020/1/22",25],
                                                                ["2020/1/23",34],
                                                                ["2020/1/24",38],
                                                                ["2020/1/25",49],
                                                                ["2020/1/26",51],
                                                                ["2020/1/27",60],
                                                                ["2020/1/28",103],
                                                                ["2020/1/29",124],
                                                                ["2020/1/30",171],
                                                                ["2020/1/31",243],
                                                                ["2020/2/1",328],
                                                                ["2020/2/2",475],
                                                                ["2020/2/3",632],
                                                                ["2020/2/4",892],
                                                                ["2020/2/5",1153],
                                                                ["2020/2/6",1540],
                                                                ["2020/2/7",2050],
                                                                ["2020/2/8",2649],
                                                                ["2020/2/9",3281],
                                                                ["2020/2/10",3996],
                                                                ["2020/2/11",4740],
                                                                ["2020/2/12",5911],
                                                                ["2020/2/13",6723],
                                                                ["2020/2/14",8096],
                                                                ["2020/2/15",9419],
                                                                ["2020/2/16",10844],
                                                                ["2020/2/17",12552],
                                                                ["2020/2/18",14376],
                                                                ["2020/2/19",16157],
                                                                ["2020/2/20",18266],
                                                                ["2020/2/21",20659],
                                                                ["2020/2/22",22888],
                                                                ["2020/2/23",24734],
                                                                ["2020/2/24",27323],
                                                                ["2020/2/25",29745],
                                                                ["2020/2/26",32495],
                                                                ["2020/2/27",36117],
                                                                ["2020/2/28",39002],
                                                                ["2020/2/29",41625],
                                                                ["2020/3/1",44462],
                                                                ["2020/3/2",47204],
                                                                ["2020/3/3",49856],
                                                                ["2020/3/4",52045],
                                                                ["2020/3/5",53726],
                                                                ["2020/3/6",55404],
                                                                ["2020/3/7",57065],
                                                                ["2020/3/8",58600],
                                                                ["2020/3/9",59897],
                                                                ["2020/3/10",61475],
                                                                ["2020/3/11",62793],
                                                                ["2020/3/12",64111],
                                                                ["2020/3/13",65541],
                                                                ["2020/3/14",66911],
                                                                ["2020/3/15",67749],
                                                                ["2020/3/16",68679],
                                                                ["2020/3/17",69601],
                                                                ["2020/3/18",70420],
                                                                ["2020/3/19",71150],
                                                                ["2020/3/20",71740],
                                                                ["2020/3/21",72244],
                                                                ["2020/3/22",72703],
                                                                ["2020/3/23",73159],
                                                                ["2020/3/24",73650],
                                                                ["2020/3/25",74051],
                                                                ["2020/3/26",74588],
                                                                ["2020/3/27",74971],
                                                                ["2020/3/28",75448],
                                                                ["2020/3/29",75770],
                                                                ["2020/3/30",76052],
                                                                ["2020/3/31",76238],
                                                                ["2020/4/1",76408],
                                                                ["2020/4/2",76571],
                                                                ["2020/4/3",76751],
                                                                ["2020/4/4",76964],
                                                                ["2020/4/5",77078],
                                                                ["2020/4/6",77167],
                                                                ["2020/4/7",77279],
                                                                ["2020/4/8",77370],
                                                                ["2020/4/9",77455],
                                                                ["2020/4/10",77525],
                                                                ["2020/4/11",77575],
                                                                ["2020/4/12",77663],
                                                                ["2020/4/13",77738],
                                                                ["2020/4/14",77816],
                                                                ["2020/4/15",77892],
                                                                ["2020/4/16",77944],
                                                                ["2020/4/17",77029],
                                                                ["2020/4/18",77062],
                                                                ["2020/4/19",77084],
                                                                ["2020/4/20",77123],
                                                                ["2020/4/21",77151],
                                                                ["2020/4/22",77207],
                                                                ["2020/4/23",77257],
                                                                ["2020/4/24",77346],
                                                                ["2020/4/25",77394],
                                                                ["2020/4/26",77474],
                                                                ["2020/4/27",77555],
                                                                ["2020/4/28",77578],
                                                                ["2020/4/29",77610],
                                                                ["2020/4/30",77642],
                                                                ["2020/5/1",77685],
                                                                ["2020/5/2",77713],
                                                                ["2020/5/3",77766],
                                                                ["2020/5/4",77853],
                                                                ["2020/5/5",77911],
                                                                ["2020/5/6",77957],
                                                                ["2020/5/7",77993],
                                                                ["2020/5/8",78046],
                                                                ["2020/5/9",78120],
                                                                ["2020/5/10",78144],
                                                                ["2020/5/11",78171],
                                                                ["2020/5/12",78189],
                                                                ["2020/5/13",78195],
                                                                ["2020/5/14",78209],
                                                                ["2020/5/15",78219],
                                                                ["2020/5/16",78227],
                                                                ["2020/5/17",78238],
                                                                ["2020/5/18",78241],
                                                                ["2020/5/19",78244],
                                                                ["2020/5/20",78249],
                                                                ["2020/5/21",78255],
                                                                ["2020/5/22",78258],
                                                                ["2020/5/23",78261],
                                                                ["2020/5/24",78268],
                                                                ["2020/5/25",78277],
                                                                ["2020/5/27",78288],
                                                                ["2020/5/28",78291],
                                                                ["2020/5/29",78302],
                                                                ["2020/5/30",78304],
                                                                ["2020/5/31",78307],
                                                                ["2020/6/1",78315],
                                                                ["2020/6/2",78314],
                                                                ["2020/6/3",78319],
                                                                ["2020/6/4",78327],
                                                                ["2020/6/5",78329],
                                                                ["2020/6/6",78332],
                                                                ["2020/6/7",78341],
                                                                ["2020/6/8",78351],
                                                                ["2020/6/9",78357],
                                                                ["2020/6/10",78361],
                                                                ["2020/6/11",78365],
                                                                ["2020/6/12",78367],
                                                                ["2020/6/13",78369],
                                                                ["2020/6/14",78370],
                                                                ["2020/6/15",78377],
                                                                ["2020/6/16",78379],
                                                                ["2020/6/17",78394],
                                                                ["2020/6/18",78398],
                                                                ["2020/6/19",78410],
                                                                ["2020/6/20",78413],
                                                                ["2020/6/21",78413],
                                                                ["2020/6/22",78425],
                                                                ["2020/6/23",78428],
                                                                ["2020/6/24",78433],
                                                                ["2020/6/25",78439],
                                                                ["2020/6/26",78444],
                                                                ["2020/6/27",78451],
                                                                ["2020/6/28",78460],
                                                                ["2020/6/29",78469],
                                                                ["2020/6/30",78479],
                                                                ["2020/7/1",78487],
                                                                ["2020/7/2",78499],
                                                                ["2020/7/3",78509],
                                                                ["2020/7/4",78516],
                                                                ["2020/7/5",78518],
                                                                ["2020/7/6",78528],
                                                                ["2020/7/7",78548],
                                                                ["2020/7/8",78590],
                                                                ["2020/7/9",78609],
                                                                ["2020/7/10",78623],
                                                                ["2020/7/11",78634],
                                                                ["2020/7/12",78648],
                                                                ["2020/7/13",78674],
                                                                ["2020/7/14",78693],
                                                                ["2020/7/15",78719],
                                                                ["2020/7/16",78737],
                                                                ["2020/7/17",78758],
                                                                ["2020/7/18",78775],
                                                                ["2020/7/19",78799],
                                                                ["2020/7/20",78817],
                                                                ["2020/7/21",78840],
                                                                ["2020/7/22",78855],
                                                                ["2020/7/23",78873],
                                                                ["2020/7/24",78889],
                                                                ["2020/7/25",78908],
                                                                ["2020/7/26",78918],
                                                                ["2020/7/27",78934],
                                                                ["2020/7/28",78944],
                                                                ["2020/7/29",78957],
                                                                ["2020/7/30",78974],
                                                                ["2020/7/31",78989],
                                                                ["2020/8/1",79003],
                                                                ["2020/8/2",79013],
                                                                ["2020/8/3",79030],
                                                                ["2020/8/4",79047],
                                                                ["2020/8/5",79057],
                                                                ["2020/8/6",79088],
                                                                ["2020/8/7",79123],
                                                                ["2020/8/8",79168],
                                                                ["2020/8/9",79232],
                                                                ["2020/8/10",79284],
                                                                ["2020/8/11",79342],
                                                                ["2020/8/12",79398],
                                                                ["2020/8/13",79462],
                                                                ["2020/8/14",79519],
                                                                ["2020/8/15",79575],
                                                                ["2020/8/16",79603],
                                                                ["2020/8/17",79642],
                                                                ["2020/8/18",79685],
                                                                ["2020/8/19",79745],]
                                                            var dateList = data.map(function (item) {
                                                                return item[0];
                                                            });
                                                            var valueList = data.map(function (item) {
                                                                return item[1];
                                                            });

                                                            option = {

                                                                // Make gradient line here
                                                                visualMap: [{
                                                                    show: false,
                                                                    type: 'continuous',
                                                                    seriesIndex: 0,
                                                                    min: 0,
                                                                    max: 400
                                                                }],


                                                                title: [{
                                                                    left: 'center',
                                                                    text: '2019-nCoV治愈人数'
                                                                }],
                                                                tooltip: {
                                                                    trigger: 'axis'
                                                                },
                                                                xAxis: [{
                                                                    data: dateList
                                                                }],
                                                                yAxis: [{
                                                                }],
                                                                // grid: [{
                                                                //     bottom: '60%'
                                                                // }, {
                                                                //     top: '60%'
                                                                // }],
                                                                series: [{
                                                                    type: 'line',
                                                                    showSymbol: false,
                                                                    data: valueList
                                                                }]
                                                            };

                                                            option && myChart.setOption(option);
                                                        }}
                                                </script>



                                            </div>
                                        </div>
                                    </div>
                                </div>

                            </div>



                        </div>

                        <div><h4>根据以上患病人数，死亡率，治愈率等数据，通过深度学习算法模拟预测出感染人口将于20<%=session.getAttribute("year")%>年达到最大，届时将有<%=session.getAttribute("count")%>人患病</h4></div>

                    </div>

                </div>
            </div>

        </div>
    </div>
</div>

<!-- 全局js -->
<script src="<%=path%>/js/jquery.min.js?v=2.1.4"></script>
<script src="<%=path%>/js/bootstrap.min.js?v=3.3.6"></script>



<!-- 自定义js -->
<script src="<%=path%>/js/content.js?v=1.0.0"></script>


<!-- Peity -->
<script src="<%=path%>/js/plugins/peity/jquery.peity.min.js"></script>

<!-- Peity -->
<script src="<%=path%>/js/demo/peity-demo.js"></script>


<!-- 全局js -->
<script src="<%=path%>/js/plugins/layer/layer.min.js"></script>
<!-- Flot -->
<script src="<%=path%>/js/plugins/flot/jquery.flot.js"></script>
<script src="<%=path%>/js/plugins/flot/jquery.flot.tooltip.min.js"></script>
<script src="<%=path%>/js/plugins/flot/jquery.flot.resize.js"></script>
<script src="<%=path%>/js/plugins/flot/jquery.flot.pie.js"></script>
<!-- 自定义js -->
<script src="<%=path%>/js/content.js"></script>
<!--flotdemo-->





</body>

</html>
